In [1]:
import pandas as pd
import sqlite3

In [7]:
# Conexión a la base de datos y creacion implicta de la misma si no existiera previamente
conexion = sqlite3.connect("./Decathlon.db")
cursor = conexion.cursor()

In [26]:
def sql_query(query):

    # Ejecuta la query
    cursor.execute(query) # Recuerda que sólo funcionará si has llamado cursor_bootcamp
                                    # a tu cursor, si no, cambia el nombre en todo el código de la función

    # Almacena los datos de la query 
    ans = cursor.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in cursor.description]

    return pd.DataFrame(ans,columns=names)

In [8]:
# Creamos las tablas necesarias
query = '''
CREATE TABLE PROVEEDOR (
    ID_proveedor INTEGER PRIMARY KEY,
    Nombre VARCHAR(50),
    Direccion VARCHAR(120),
    Ciudad VARCHAR(40),
    Provincia VARCHAR,
    CIF VARCHAR(10),
    Telefono VARCHAR(15),
    email VARCHAR(40)

)
'''
cursor.execute(query)

In [9]:
datos_proveedores = [
    (1, "Adidas", "Calle Deportes, 123", "Barcelona", "Barcelona", "A12345678", "+34 123 456 789", "contacto@adidas.com"),
    (2, "Nike", "Avenida del Deporte, 456", "Madrid", "Comunidad de Madrid", "B87654321", "+34 987 654 321", "contacto@nike.com"),
    (3, "Puma", "Calle Fitness, 789", "Valencia", "Valencia", "C56789012", "+34 234 567 890", "contacto@puma.es"),
    (4, "Under Armour", "Carrera Extrema, 101", "Tarragona", "Barcelona", "D34567890", "+34 345 678 901", "contacto@underarmour.com"),
    (5, "GymShark", "Paseo del Deporte, 555", "Oviedo", "Principado de Asturias", "E23456789", "+34 456 789 012", "contacto@gymshark.com"),
    (6, "New Balance", "Plaza Deportiva, 222", "Plasencia", "Cáceres", "F45678901", "+34 567 890 123", "contacto@newbalance.com"),
    (7, "North Face", "Avenida de la Aventura, 333", "Leganés", "Comunidad de Madrid", "G56789012", "+34 678 901 234", "contacto@northface.com"),
    (8, "Deportes Pepito", "Calle Total, 444", "Novelda", "Alicante", "H67890123", "+34 789 012 345", "pepitodelospalotes1@gmail.es"),
]
# Insertar datos en la tabla Proveedor
insert_query = "INSERT INTO Proveedor (ID_Proveedor, Nombre, Direccion, Ciudad, Provincia, CIF, Telefono, email) VALUES (?, ?, ?, ?, ?, ?, ?, ?)"

# Ejecutar la sentencia SQL para insertar los datos en la tabla
cursor.executemany(insert_query, datos_proveedores)

# Confirmar la transacción
conexion.commit()

In [10]:
# Creamos la tabla Categoria
query = '''
CREATE TABLE CATEGORIA (
    ID_categoria INTEGER PRIMARY KEY,
    Nombre_Categoria VARCHAR)
'''
cursor.execute(query)

In [11]:
# Datos de 20 categorías de tejidos
datos_categorias = [
    (1, 'Calzado deportivo'),
    (2, 'Fitness'),
    (3, 'Ciclismo'),
    (4, 'Baloncesto'),
    (5, 'Natación'),
]
insert_query_categorias = "INSERT INTO Categoria (ID_Categoria, Nombre_Categoria) VALUES (?, ?)"

cursor.executemany(insert_query_categorias, datos_categorias)
conexion.commit()

In [12]:
# Creamos la tabla Productos
query = '''
CREATE TABLE PRODUCTOS (
    ID_Producto INTEGER PRIMARY KEY,
    Nombre VARCHAR(40),
    Color TEXT,
    Precio FLOAT,
    ID_Categoria INTEGER,
    FOREIGN KEY (ID_Categoria) REFERENCES Categoria(ID_Categoria)
)
'''
cursor.execute(query)

In [13]:
datos_productos = [
    (1, 'Balón de baloncesto', 'Naranja', 19.99, 4),
    (2, 'Camiseta', 'Azul', 14.99, 2),
    (3, 'Bicicleta normalita', 'Rosa', 209.99, 3),
    (4, 'Bicicleta eléctrica de lujo', 'Negro', 1599.99, 3),
    (5, 'Gorro de natación', 'Negro', 5.99, 5),
    (6, 'Zapatillas Air', 'Amarillo', 109.99, 1),
    (7, 'Alfombrilla de yoga', 'Azul', 14.99, 2),
    (8, 'Mancuernas 8kg.', 'Negro', 39.99, 2),
    (9, 'Zapatillas running', 'Verde', 89.99, 1),
    (10, 'Canasta', 'Rojo', 249.99, 4),
]
insert_query_productos = "INSERT INTO Productos (ID_Producto, Nombre, Color, Precio, ID_Categoria) VALUES (?, ?, ?, ?, ?)"

cursor.executemany(insert_query_productos, datos_productos)
conexion.commit()

In [14]:
# Creamos la tabla Histórico Productos
query = '''
CREATE TABLE HISTORICO_PRODUCTOS (
    Cantidad INTEGER,
    Fecha DATE,
    ID_Proveedor INTEGER,
    ID_Producto INTEGER,
    FOREIGN KEY (ID_Proveedor) REFERENCES Proveedor(ID_Proveedor),
    FOREIGN KEY (ID_Producto) REFERENCES Productos(ID_Producto)
)
'''
cursor.execute(query)

In [16]:
datos_historico_productos = [
    (100, "2024-01-01", 2, 2),
    (150, "2024-03-30", 1, 2),
    (130, "2024-02-20", 2, 4),
    (200, "2023-10-23", 7, 3),
    (400, "2024-04-15", 6, 7),
    (140, "2024-07-18", 5, 8),
    (50, "2024-06-19", 3, 9),
    (140, "2024-09-12", 1, 10),
    (120, "2024-03-08", 8, 3),
    (190, "2024-04-05", 2, 1),
    (180, "2024-02-09", 1, 4),
    (300, "2024-01-21", 9, 7),
    (200, "2024-08-29", 7, 6),
    (30, "2024-09-28", 4, 4),
    (40, "2024-04-21", 2, 9),
    (70, "2024-06-18", 5, 3)
]
insert_query_historico_productos = "INSERT INTO HISTORICO_PRODUCTOS (Cantidad, Fecha, ID_Proveedor, ID_Producto) VALUES (?, ?, ?, ?)"

cursor.executemany(insert_query_historico_productos, datos_historico_productos)
conexion.commit()

In [17]:
query = """
CREATE TABLE FACTURAS (
    Id_factura VARCHAR(12) PRIMARY KEY,
    Id_proveedor VARCHAR(6),
    Id_producto VARCHAR(3),
    Precio FLOAT,
    Cantidad INTEGER,
    Fecha DATE,
    Dirección_fiscal VARCHAR(120),
    Ciudad VARCHAR(40),
    Provincia VARCHAR(40),
    Entregado BOOL,
    Total_factura FLOAT,
    FOREIGN KEY (Id_proveedor) REFERENCES PROVEEDOR(Id_proveedor)
    FOREIGN KEY (Id_producto) REFERENCES PRODUCTOS(Id_producto)
)
"""
cursor.execute(query)

In [18]:
datos_facturas = [
(1, 19.99, 1, '2024-03-20', 'Calle Sierpes, 4', 'Sevilla', 'Sevilla', True, 19.99, 1, 1),
(2, 5.99, 3, '2024-03-02', 'Calle Deportes, 123', 'Barcelona', 'Barcelona', True, 17.97, 1, 5),
(3, 19.99, 2, '2024-03-20', 'Calle Deportes, 123', 'Barcelona', 'Barcelona', True, 39.98, 1, 1),
(4, 14.99, 3, '2024-03-19', 'Avenida del Deporte, 456', 'Madrid', 'Comunidad de Madrid', False, 44.97, 2, 7),
(5, 209.99, 1, '2024-03-18', 'Calle Fitness, 789', 'Valencia', 'Valencia', True, 209.99, 3, 3),
(6, 1599.99, 1, '2024-03-17', 'Carrera Extrema, 101', 'Tarragona', 'Barcelona', True, 1599.99, 4, 4),
(7, 5.99, 2, '2024-03-16', 'Paseo del Deporte, 555', 'Oviedo', 'Principado de Asturias', False, 11.98, 5, 5),
(8, 109.99, 1, '2024-03-15', 'Plaza Deportiva, 222', 'Plasencia', 'Cáceres', True, 109.99, 6, 6),
(9, 14.99, 3, '2024-03-14', 'Avenida de la Aventura, 333', 'Leganés', 'Comunidad de Madrid', True, 44.97, 7, 7),
(10, 39.99, 1, '2024-03-13', 'Calle Total, 444', 'Novelda', 'Alicante', False, 39.99, 8, 8),
(11, 89.99, 2, '2024-03-12', 'Calle Deportes, 123', 'Barcelona', 'Barcelona', True, 179.98, 1, 9),
(12, 249.99, 1, '2024-03-11', 'Avenida del Deporte, 456', 'Madrid', 'Comunidad de Madrid', False, 249.99, 2, 10)
]

insert_query_facturas = "INSERT INTO FACTURAS (Id_factura, Precio, Cantidad, Fecha, Dirección_fiscal, Ciudad, Provincia, Entregado, Total_factura, Id_proveedor, Id_producto) VALUES (?,?,?,?,?,?,?,?,?,?,?)"

cursor.executemany(insert_query_facturas, datos_facturas)
conexion.commit()

In [19]:
# Creamos la tabla Catalogo
query = '''
CREATE TABLE CATALOGO (
    ID_Proveedor INTEGER,
    ID_Producto INTEGER,
    FOREIGN KEY (ID_Proveedor) REFERENCES Proveedor(ID_Proveedor),
    FOREIGN KEY (ID_Producto) REFERENCES Productos(ID_Producto)
)
'''
cursor.execute(query)

In [21]:
datos_catalogo = [
    (2,2),
    (1,2),
    (2,4),
    (7,3),
    (6,7),
    (5,8),
    (1,10)  
]

insert_query_catalogo = "INSERT INTO CATALOGO (Id_Proveedor, ID_Producto) VALUES (?,?)"

cursor.executemany(insert_query_catalogo, datos_catalogo)
conexion.commit()

In [28]:
query = '''
SELECT 
FROM facturas
'''

sql_query(query)

,Id_factura,Id_proveedor,Id_producto,Precio,Cantidad,Fecha,Dirección_fiscal,Ciudad,Provincia,Entregado,Total_factura
0,1,1,1,19.99,1,2024-03-20,"Calle Sierpes, 4",Sevilla,Sevilla,1,19.99
1,2,1,5,5.99,3,2024-03-02,"Calle Deportes, 123",Barcelona,Barcelona,1,17.97
2,3,1,1,19.99,2,2024-03-20,"Calle Deportes, 123",Barcelona,Barcelona,1,39.98
3,4,2,7,14.99,3,2024-03-19,"Avenida del Deporte, 456",Madrid,Comunidad de Madrid,0,44.97
4,5,3,3,209.99,1,2024-03-18,"Calle Fitness, 789",Valencia,Valencia,1,209.99
5,6,4,4,1599.99,1,2024-03-17,"Carrera Extrema, 101",Tarragona,Barcelona,1,1599.99
6,7,5,5,5.99,2,2024-03-16,"Paseo del Deporte, 555",Oviedo,Principado de Asturias,0,11.98
7,8,6,6,109.99,1,2024-03-15,"Plaza Deportiva, 222",Plasencia,Cáceres,1,109.99
8,9,7,7,14.99,3,2024-03-14,"Avenida de la Aventura, 333",Leganés,Comunidad de Madrid,1,44.97
9,10,8,8,39.99,1,2024-03-13,"Calle Total, 444",Novelda,Alicante,0,39.99
10,11,1,9,89.99,2,2024-03-12,"Calle Deportes, 123",Barcelona,Barcelona,1,179.98
11,12,2,10,249.99,1,2024-03-11,"Avenida del Deporte, 456",Madrid,Comunidad de Madrid,0,249.99

In [29]:
query = '''
SELECT DISTINCT Ciudad
FROM Proveedor
'''
sql_query(query)

      Ciudad
0  Barcelona
1     Madrid
2   Valencia
3  Tarragona
4     Oviedo
5  Plasencia
6    Leganés
7    Novelda

In [33]:
query = '''
SELECT b.nombre_categoria as Categoria, a.nombre as Producto
FROM Productos AS a
LEFT JOIN Categoria AS b
ON a.ID_Categoria = b.ID_Categoria
'''

sql_query(query)

           Categoria                     Producto
0         Baloncesto          Balón de baloncesto
1            Fitness                     Camiseta
2           Ciclismo          Bicicleta normalita
3           Ciclismo  Bicicleta eléctrica de lujo
4           Natación            Gorro de natación
5  Calzado deportivo               Zapatillas Air
6            Fitness          Alfombrilla de yoga
7            Fitness              Mancuernas 8kg.
8  Calzado deportivo           Zapatillas running
9         Baloncesto                      Canasta